# Estudo com livro Ciência de dados com Python!

In [38]:
import pandas as pd #importar biblioteca pandas.

foi importado o bibliotecas pandas para o ambiente de execução, após isso será criado o data freme como df noqual recebirar como atruiição o arquivo do excelpela método pd.read_excell("caminho do arquivo")

In [39]:
df = pd.read_excel("C:/Users/Danilo Macedo/Data-Science-Projects-with-Python/Data/default_of_credit_card_clients__courseware_version_1_21_19.xls")
# carregamento o arquivo xls para trabalahr com ele no pandas, o arquivo foi atribuido ao data frame df.

### Será utilizado a função pd.shape para verificar a quantidade delinhas e colunas do arquivo carregado pelo método pd.read_excell

In [40]:
df.shape # método .shape para verificar quantidade de linhas e colunas do arquivo xls carregado.

(30000, 25)

In [41]:
 df.head(5) #método .head() utilizado para visualização do dataset

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [42]:
df.info() # método .info possibilita a visualização das colunas com seus respectivos tipos e como se fosse o metadados do dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_1                       30000 non-null  object
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.7+ MB

In [43]:
df.columns # método utilizado para verificar a integridade dos dados nessa nesta estapa poderá ser visualizado o nome das colunas ou seja os label

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

In [44]:
df.shape #método .shape para mostrar a quantidade de linhas e colunas do dataframe

(30000, 25)

In [45]:
df['ID'].nunique() # método utilizado para verificar na coluna especificada ['id'] quantas são exclusivas.

29687

Analisando a saida dos métodos .shape e .nunique podemos verificar que os no total de 3000 Ids que deveriam ser único apenas 29687 são distintos entre si. Será criado um metodo id_counts para armmazenas os ids com suas respectivas quantidades na celula abaixo.

In [46]:
id_counts = df['ID'].value_counts()  # varável id_counts receberá os valores da coluna ID, com suas respectivas quantidade devido por conta do output
# do método  .value_counts
id_counts.head()

ID
7d5f3242-e1df    2
1b22b0ab-aba3    2
4cb27699-fe3f    2
91c69d1a-8732    2
bf23c70b-bf12    2
Name: count, dtype: int64

In [47]:
id_counts.value_counts() #o método value_coutns apresenta como saída o valor de itens distintos e valor de itens duplicados

count
1    29374
2      313
Name: count, dtype: int64

In [48]:
import numpy as np

Exercício 4: continuando a verificação da integridade de dados.

In [49]:
dupe_mask = id_counts == 2 # cria uma variável para atribuir mascara logica onde os id que seja igual a 2 seja true
dupe_mask[0:5] # a função disso e criaar uma mascara boleana para localizar os dados duplicados.

ID
7d5f3242-e1df    True
1b22b0ab-aba3    True
4cb27699-fe3f    True
91c69d1a-8732    True
bf23c70b-bf12    True
Name: count, dtype: bool

In [50]:
id_counts.index[0:10]   # aqui estamos utilizando o .index para acessar o indice de ids

Index(['7d5f3242-e1df', '1b22b0ab-aba3', '4cb27699-fe3f', '91c69d1a-8732',
       'bf23c70b-bf12', 'db91a87c-3cbe', '428b26a3-dca2', '424e8a3c-0377',
       'ff619017-560f', 'f6032812-464e'],
      dtype='object', name='ID')

In [51]:
dupe_ids = id_counts.index[dupe_mask]  # criar uma variável para armazenas os ids duplicado 
dupe_ids = list(dupe_ids) # transformando os ids duplicados em uma lista 
len(dupe_ids) # contanto os itens da lista

313

In [53]:
df.loc[df['ID'].isin(dupe_ids[0:3]),:].head(10)

# Filtra o DataFrame 'df' para selecionar as linhas onde a coluna 'ID' está presente nos primeiros três IDs duplicados.
# Em seguida, exibe as primeiras 10 linhas do resultado filtrado.

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
5374,1b22b0ab-aba3,30000,2,1,2,30,0,0,0,0,...,32389,33142,33999,1600,2000,1500,1200,1330,2500,0
5474,1b22b0ab-aba3,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
5583,7d5f3242-e1df,60000,1,1,2,22,Not available,0,2,0,...,29137,29900,30069,4400,304,1100,1216,1300,589,0
5683,7d5f3242-e1df,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
11848,4cb27699-fe3f,60000,2,6,1,39,-1,-1,-1,-1,...,2248,0,449,1419,3541,2248,0,449,0,0
11948,4cb27699-fe3f,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [55]:
df_zero_mask = df == 0 # pegou o dataframe e o transformou em mascara boeana para verificar posteriormente se todos elemento de uma linha são zeros pra ser excluidas.
df_zero_mask.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,False,False,False,False,False,False,False,False,False,False,...,True,True,True,True,False,True,True,True,True,False
1,False,False,False,False,False,False,False,False,True,True,...,False,False,False,True,False,False,False,True,False,False
2,False,False,False,False,False,False,True,True,True,True,...,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,True,True,True,True,...,False,False,False,False,False,False,False,False,False,True
4,False,False,False,False,False,False,False,True,False,True,...,False,False,False,False,False,False,False,False,False,True

In [58]:
feature_zero_mask = df_zero_mask.iloc[:,1:].all(axis=1)  # conta total de linha onde exceto o primeiro item são zeros
sum(feature_zero_mask)

315

In [60]:

df_clean_1 = df.loc[~feature_zero_mask, :].copy()

# Filtra o DataFrame 'df' para excluir as linhas onde todos os elementos (exceto o primeiro) são zeros.
# Cria uma cópia do DataFrame resultante e a armazena na variável 'df_clean_1'.

In [61]:
df_clean_1.shape

(29685, 25)

In [64]:
df_clean_1['ID'].nunique()  #verificando que as linhas com ids duplicado e zerados foram excluida no novo dataframe clean.

29685

# Explorando e Limmpando dados.

In [66]:
df_clean_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29685 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          29685 non-null  object
 1   LIMIT_BAL                   29685 non-null  int64
 2   SEX                         29685 non-null  int64
 3   EDUCATION                   29685 non-null  int64
 4   MARRIAGE                    29685 non-null  int64
 5   AGE                         29685 non-null  int64
 6   PAY_1                       29685 non-null  object
 7   PAY_2                       29685 non-null  int64
 8   PAY_3                       29685 non-null  int64
 9   PAY_4                       29685 non-null  int64
 10  PAY_5                       29685 non-null  int64
 11  PAY_6                       29685 non-null  int64
 12  BILL_AMT1                   29685 non-null  int64
 13  BILL_AMT2                   29685 non-null  int64
 14  BILL_AMT3                   29685 non-null  int64
 15  BILL_AMT4                   29685 non-null  int64
 16  BILL_AMT5                   29685 non-null  int64
 17  BILL_AMT6                   29685 non-null  int64
 18  PAY_AMT1                    29685 non-null  int64
 19  PAY_AMT2                    29685 non-null  int64
 20  PAY_AMT3                    29685 non-null  int64
 21  PAY_AMT4                    29685 non-null  int64
 22  PAY_AMT5                    29685 non-null  int64
 23  PAY_AMT6                    29685 non-null  int64
 24  default payment next month  29685 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.9+ MB

In [68]:
df_clean_1['PAY_1'].head(5)

0     2
1    -1
2     0
3     0
4    -1
Name: PAY_1, dtype: object

In [71]:
df_clean_1['PAY_1'].value_counts()

PAY_1
0                13087
-1                5047
1                 3261
Not available     3021
-2                2476
2                 2378
3                  292
4                   63
5                   23
8                   17
6                   11
7                    9
Name: count, dtype: int64

In [81]:
valid_pay_1_mask = df_clean_1['PAY_1'] != 'Not available'

In [82]:
valid_pay_1_mask[0:5]

0    True
1    True
2    True
3    True
4    True
Name: PAY_1, dtype: bool

In [83]:
sum(valid_pay_1_mask)

26664